# Rebar Max Spacing Property

Source: https://www.revitapidocs.com/2026/1e7105e5-8d08-26ed-d97d-76754753fded.htm

---

| Rebar Max Spacing Property |
| --- |

Identifies the maximum spacing between rebar in rebar set.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double MaxSpacing { get; set; }
```

```
Public Property MaxSpacing As Double
	Get
	Set
```

```
public:
property double MaxSpacing {
	double get ();
	void set (double value);
}
```

```
member MaxSpacing : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The maxSpacing isn't bigger than 0\.0\. |
| InapplicableDataException | This rebar element represents a single bar (the layout rule is Single).  \-or\-  When setting this property: The rebar set layout does not permit changing the maximum spacing. |

Remarks The maximum spacing can be set for rebar sets with layout rule MaximumSpacing, MinimumClearSpacing, or NumberWithSpacing. See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace